_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1200, 300)         12733200  
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 1196, 64)          96064     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 34, 64)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2176)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                139328    
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 65        
=================================================================
Total params: 12,968,657
Trainable params: 235,457
Non-trainable params: 12,733,200
_________________________________________________________________
None
